{"modelTopology": {"backend": "tensorflow", "keras_version": "2.1.4", "model_config": {"config": [{"config": {"activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "padding": "valid", "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 32, "use_bias": true, "kernel_constraint": null, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "dilation_rate": [1, 1], "filters": 64, "use_bias": true, "kernel_constraint": null, "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 128, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"seed": null, "trainable": true, "name": "dropout_2", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 10, "use_bias": true, "kernel_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"loss": "categorical_crossentropy", "optimizer_config": {"config": {"epsilon": 1e-07, "rho": 0.95, "decay": 0.0, "lr": 1.0}, "class_name": "Adadelta"}, "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group3-shard1of2", "group3-shard2of2"], "weights": [{"name": "dense_1/kernel", "shape": [9216, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32"}]}]}